In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(),columns='W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A -0.369938 -1.931588 -0.278233 -0.435535
B -0.854281 -0.020892 -0.670977 -1.607499
C  0.942661  0.506586 -1.272658 -0.112708
D -0.535003  0.005804  2.542079 -0.838626
E  0.683392  0.411116 -0.804240  1.870855

In [8]:
#menampilkan data kolom y dan x berdasarkan pada kolom w yang lebih dari 0
df[df['W']>0] [['Y','X']]

          Y         X
C -1.272658  0.506586
E -0.804240  0.411116

In [10]:
#menampilkan data berdasarkan kolom w yg lebih dari 0 dan kolom x lebih dari 1
df[(df['W']>0) & (df['X']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [11]:
#menampilkan data berdasarkan kolom w yg lebih dari 0 dan kolom x lebih dari 0
df[(df['W']>0) | (df['X']>0)]

          W         X         Y         Z
C  0.942661  0.506586 -1.272658 -0.112708
D -0.535003  0.005804  2.542079 -0.838626
E  0.683392  0.411116 -0.804240  1.870855

In [12]:
#mereset index labels menjadi index default
df.reset_index()

  index         W         X         Y         Z
0     A -0.369938 -1.931588 -0.278233 -0.435535
1     B -0.854281 -0.020892 -0.670977 -1.607499
2     C  0.942661  0.506586 -1.272658 -0.112708
3     D -0.535003  0.005804  2.542079 -0.838626
4     E  0.683392  0.411116 -0.804240  1.870855

In [13]:
#membuat kolom baru
df["code"] = "IDN JPN USA RSA IND".split()

In [14]:
df

          W         X         Y         Z code
A -0.369938 -1.931588 -0.278233 -0.435535  IDN
B -0.854281 -0.020892 -0.670977 -1.607499  JPN
C  0.942661  0.506586 -1.272658 -0.112708  USA
D -0.535003  0.005804  2.542079 -0.838626  RSA
E  0.683392  0.411116 -0.804240  1.870855  IND

In [15]:
#mengatur agar code menjadi index labels
df.set_index('code')

             W         X         Y         Z
code
IDN  -0.369938 -1.931588 -0.278233 -0.435535
JPN  -0.854281 -0.020892 -0.670977 -1.607499
USA   0.942661  0.506586 -1.272658 -0.112708
RSA  -0.535003  0.005804  2.542079 -0.838626
IND   0.683392  0.411116 -0.804240  1.870855

In [16]:
#ketika di tampilkan sama seperti
#drop tidak berubah dan harus menggunakan inplace
df

          W         X         Y         Z code
A -0.369938 -1.931588 -0.278233 -0.435535  IDN
B -0.854281 -0.020892 -0.670977 -1.607499  JPN
C  0.942661  0.506586 -1.272658 -0.112708  USA
D -0.535003  0.005804  2.542079 -0.838626  RSA
E  0.683392  0.411116 -0.804240  1.870855  IND

In [17]:
df.set_index('code',inplace=True)

In [18]:
df

             W         X         Y         Z
code
IDN  -0.369938 -1.931588 -0.278233 -0.435535
JPN  -0.854281 -0.020892 -0.670977 -1.607499
USA   0.942661  0.506586 -1.272658 -0.112708
RSA  -0.535003  0.005804  2.542079 -0.838626
IND   0.683392  0.411116 -0.804240  1.870855

In [19]:
dataLabels = ['G1','G1','G1','G2','G2','G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue)) #zip : menggabungkan 2 array atau lebih menjadi beberapa tuple
                                       #List : mebuat list dari tuple-tuple yang ada
data = pd.MultiIndex.from_tuples(data) #membuat beberapa pengindexan baru dari sebuah tuple

In [21]:
list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [22]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [25]:
df = pd.DataFrame(np.random.randn(6,2),index=data,columns=['A','B'])
df

             A         B
G1 1  0.342220 -0.506127
   2  1.084060  0.667741
   3  0.281571  0.942158
G2 1 -0.101395  0.714043
   2 -1.728371 -0.303774
   3  0.399686  0.580082

In [26]:
#menampilkan index dari G1

In [27]:
df.loc['G1']

          A         B
1  0.342220 -0.506127
2  1.084060  0.667741
3  0.281571  0.942158

In [28]:
#menampilkan index dari G1 sub index 3
df.loc['G1'].loc[3]

A    0.281571
B    0.942158
Name: 3, dtype: float64

In [29]:
#melihat nama index 
df.index.names

FrozenList([None, None])

In [30]:
#merubah nama index
df.index.names = ['Group','Num']

In [31]:
df

                  A         B
Group Num
G1    1    0.342220 -0.506127
      2    1.084060  0.667741
      3    0.281571  0.942158
G2    1   -0.101395  0.714043
      2   -1.728371 -0.303774
      3    0.399686  0.580082

In [32]:
df.xs('G1') #xs : untuk menampilkan dataFrame multiindex

            A         B
Num
1    0.342220 -0.506127
2    1.084060  0.667741
3    0.281571  0.942158

In [33]:
#menampilkan index labels G2 dengan sub index 2
df.xs(['G2',2])

A   -1.728371
B   -0.303774
Name: (G2, 2), dtype: float64

In [34]:
#menampilkan sub index 1 dari kolom num
df.xs(1,level='Num')

              A         B
Group
G1     0.342220 -0.506127
G2    -0.101395  0.714043